{"intro":[
  {  "title":"Task statement",
    "content":["As a UI designer at Knowledgehook, I dedicated myself to the crucial task of optimizing and developing our new design system. Currently in its initial stages, the design system comprises a foundational framework and two themes. To ensure a scalable and well-structured development process, it's imperative that we further refine and optimize the design system."]
},
{
  "title":"Objectives",
  "content":[
    "1. Improve the scalability.Optimize the system to accommodate growth and evolution.",
    "2. Support the accessibility. Ensure that the design system is usable by people with disabilities.",
    "3. Promote the efficiency.  Streamline the design and development process.",
    "4. Facilitate the collaboration. Facilitate collaboration among designers, developers, and other stakeholders."
  ]
}
],
"firstApproach":{
  "title":"1.Research and presentation",
  "content":"To enhance scalability, I conducted extensive research on well-established design systems, analyzing their components, structures, and guiding principles. Utilizing this knowledge, I scrutinized our own design system, identifying potential scalability issues. I then recommended and implemented effective solutions drawn from my findings to address these concerns, presenting them to the team for consideration. After collaborative discussions and gathering feedback from both the design and development teams, I've implemented progressive enhancements within the design system. They include:",
  "subtitleA":"Renaming design tokens",
  "subContentA":"I proposed  and implemented renaming all the color tokens from primitive to semantic way. It is more future-proofing to ensure that the design system remains relevant and adaptable in the long term.All tokens are renamed in a short form for effective coding as well.",
  "subtitleB": "Simplify token systems across themes",
  "subContentB":"After scrutinizing all tokens, I removed one-time used values in tokens.I also compared tokens used in two different themes , and unified all tokens to maintain consistency. I attempted to establish flexible structures and patterns in the system that can adapt to changing needs over time."
},
"approach":[
{
  "title":"2. Implement WCAG to build accessibility",
  "content":"To ensure our design system meet accessibility standards, I rigorously tested our design elements—including colors, font sizes, and icons—using both accessibility testing tools and WCAG 2.2 standards. Upon analyzing the test results, I devised solutions to rectify any elements that did not meet the required standards."
},
{
  "title":"3. Build reusable components to streamline process",
  "content":"When meeting with a design need of new components, we facilitate the process of building, sharing, documenting, and communicating across design and development team.  Every new built component will be shared in the design team and adjusted for different design context. I also take the responsible for documenting design breakdowns, usage, interaction, and code examples in a shareable platform for design and development reference. It helps to reduce the coding efforts and time."
},
{
  "title":"4. Post real-time update to facilitate collaboration",
  "content":"To ensure great collaboration and reduce duplication of effort, I keep posting real-time update for the design system in a specific channel. Therefore, designers and developers can get the most updated notices."
}
],
"achievement":[
  {
    "title":"Reduce building time and efforts",
    "content":"Optimizing our design system plays a pivotal role in streamlining our development process, significantly reducing both build time and effort. By refining and fine-tuning the system, we ensure that designers and developers can efficiently access and utilize standardized components and guidelines, eliminating the need to recreate elements from scratch. This not only accelerates the development cycle but also enhances consistency and scalability across projects."
  },
 {
    "title":"Facilitate seamless workflow from design to develop",
    "content":"The documentation of our design system streamlines the design hand-off process, enabling designers, product managers, and developers to access necessary information whenever required. This minimizes miscommunication and enhances collaboration across teams."
  },
  {
    "title":"Enhancing user experience",
    "content":"After optimizing the design system, it significantly enhances our ability to maintain brand consistency throughout the design process. Every design decision within the system is carefully crafted with users' needs and satisfaction in mind. Consequently, this optimization results in a user interface that is not only more visually appealing but also more accessible and user-friendly."
  }
],

"solution":{
  "subtitle":"How My Design Solves The Problems",
  "explaination":[
    {
      "title":"Minimize Steps of Looking For The Planner",
      "content":"To streamline the process of finding the perfect event planner, our app allows users to explore without requiring an account creation. This approach minimizes unnecessary steps, enhancing the overall user experience. Planners are easily discoverable through multiple avenues, including name searching, sorting, and category selection. Crucial information, such as hourly rates, work experience, and user reviews, is transparently provided, facilitating efficient matching between users and planners."
    },
    {
      "title":"Strong Transparency in the Planning Progress",
      "content":"Addressing a common user frustration, our app offers seamless transparency throughout the event planning journey. By providing real-time updates on the progress, from initial planning stages to hosting, users can stay informed every step of the way. Additionally, our platform facilitates direct communication between users and planners, fostering efficient collaboration and ensuring a smooth planning experience"
    },
    {
      "title":"Simply event booking process with small tasks",
      "content":"To streamline the user experience, the app simplifies the booking process into three concise tasks, reducing cognitive load. Users can focus on each task, ensuring accurate completion. Critical event details, including date, time, event planner, and cost, are readily accessible at every step, minimizing input errors."
    }

  ]
},
"UI":{
  "subtitle":"What is my UI design approach",
  "explaination":[
    {
      "title":"Establishing Design Consistency with a Custom UI Kit",
      "content":"To foster user familiarity with the brand and deliver a delightful visual experience through the app, I developed a scalable UI kit. This kit ensures consistency across design elements by providing a structured framework for fonts, colors, icons, and components. Additionally, it facilitates seamless design interaction and collaboration with development."
    },
    {
      "title":"Utilizing Design Elements for Effective Information Hierarchy",
      "content":"The app crafts seamless user experiences through visual organization. Different font sizes, spacing, logical groupings, and semantic colors are applied to support visual priority and emphasis. By categorizing and structuring content based on importance, it enhances readability, preventing information overload and reducing cognitive strain."
    }
  ]
}
}