{
  
"intro":"This project is a three-month client base project for Ontario Deaf Literacy Initiative. The project goal is to design and build up a video-based survey web page for Ontario Deaf Literacy Initiative. The web page is designed for students in the Ontario Deaf Literacy program to understand and support their needs. The GBC team for this project includes one teacher leader and two student designers.",
"task":["Design an accessible video-based web page that meets the client’s expectation and users needs", "Implement the finalized web page design to a front-end web page"],
"approach":[{
  "title":"1. Stakeholder Interview - Understand Needs and Goals",
  "content":"Our team launched a stakeholder interview at the beginning of the project, to understand the client's goals. In the interview, the client introduced users' needs to us. The client is expecting a survey web page that could best visualize the content and simplify the survey process."
},
{
  "title":"2. Integrating HCI - Confront Design With Accessibility Guidelines",
  "content":"Before designing the survey web page, I need to overcome the challenge of finding an accessible way for target users to interact with the web page. Therefore, I integrated human-computer interaction in my design process to explore the significant human factors. The human factor activities review the operational experience issues, functions analysis, and tasks analysis. Each review provides design recommendations in integrating human factors into design. The human system interface review report also provides accessibility standards for web design. It provides insights and guidelines to confront the design with the WCAG."
},
{
  "title":"3.1 Building Sitemap",
  "content":"Based on the design recommendations from HF activities, my next challenge is applying the theories to the interface design. I used a task-oriented sitemap to resolve the problem. The structure helps me to have an insight into the hierarchy of information and user flow."
},
{
  "title":"3.2 Wireframe",
  "content":"Creating a wireframe is my next step to visualize sitemap. The sidebar navigates and tracks the process all through the survey intuitively. Consistent design of the layout, forms, and buttons support users fast to learn and use the web page. The web page also provides descriptive text for the video questions to support users with different literacy levels."
  },
  {
    "title":"3.3 mockups",
    "content":"I designed the mockups based on the finalized wireframe. Our team presented the deliverable mockups to the client and adjusted them with feedback. After the mockups are finalized, I launched the front-end web development work."
    }
],
"feature":[
  "Storing input data from users to local storage",
  "Fetch and print data from local storage",
  "Customized design style",
  "Different types of forms support data manipulation",
  "Updating content on one page"
],
"challenge":[{
  "title":"1. Creating question buttons that navigate to corresponded question pages without reloading the whole page.",
  "content":"There are a total of 12 question buttons that navigate users to their question pages. The submit and skip buttons will direct to the next question page. I tried to create on-click events for each button. When the button is click, it calls the corresponded function. The function will only reload the HTML inner text to update the page content. The purpose is to avoid reloading new pages so that it could reduce the loading time."
},
{"title":"2. Storing data to local storage",
 "content":"In this project, I need to store the users’ answers to the local storage for further back-end development. In this case, I created a set local storage function. Each click of the submit button will trigger the set local storage function to store the input."
}
],
"improvement":"As a start-up front-end web developer, it is my first javascript project and it has a lot of aspects to improve in this project. I would want to minify the CSS by using SASS. SASS could support reuse style by nesting and extending CSS selectors. I also need to work on restructuring the code in a more organized way. I want to simplify the code by making some functions more reusable."
}